import streamlit as st

#ส่วนที่ 1 หัวข้อเว็บ (titleสีแดง)
st.markdown("# :red[🏋️แอปพลิเคชั่นคำนวณค่าดัชนีมวลกาย BMI]")
st.write("กรอกข้อมูลน้ำหนักและส่วนสูงของคุณ เพื่อเช็คสุขภาพเบื้องต้น")

#ส่วนที่ 2 สร้างช่องค่ารับค่าน้ำหนัก และ ส่วนสูง
weight = st.number_inptu("กรอกรน้ำหนักของคุณ (กิโบกรัม):")
height_cm = st.number_input("กรอกส่วนสูงของคุณ (เซนติเมตร)")

if st.button("คำนวณค่า BMI"):
      height_m = height_cm / 100
      bmi = weight / (height_m**2)

      st.write("---")

      st.header(f"ค่า BMI ของคุณคือ: **{bmi:.2f}**")

 if bmi < 18.5:
      st.warning("⚠️คุณมีน้ำหนักน้อยกว่าเกณฑ์")
 elif 18.5 <= bmi < 23.0:
      st.success("❤️คุณมีน้ำหนักอยู่ในเกณฑ์ปกติ (สุขภาพดี)")
 elif 23.0 <= bmi < 25.0:
      st.success("🔥คุณเริ่มมีน้ำหนักเกิรน (ท้วม)")
 else:
      st.error("🚨 คุณอยู่ในเกณฑ์อ้วน ควรระวังเรื่องสุขภาพและออกกำลังกาย")

st.divider()
st.write("นางสาวพรรณกาญจน์ แสงสังข์ เลขที่ 3 ม.4/7")

     
